import React from 'react'
import '../../../main.css'

const About = (props) => {
  return (
    <section>
      <h2>About Me</h2>
      <p>
        안녕하세요~ 감각적인 프론트엔드 웹개발자를 지향하는 서수연이라고 합니다. 저는 웹접근성과 시멘틱한 마크업을
        중요하게 생각하고 있으며, 깨끗하고 시적인 코드를 지향하고 있습니다. 또한 복잡한 문제를 심플하게 녹여내는 것을
        즐기며, 아름답고 상호작용 가능한 디자인으로 바꾸는 것을 좋아합니다.
      </p>
      <p>프론트 엔드</p>
      <p>HTML5, CSS3, JavaScript(ES6~), Sass, React</p>
      <p>기획, 소통</p>
      <p>UI&UX를 고려한 웹설계, 원활한 소통, 귀여운 영어 실력, 원어민급 일본어 실력</p>
      <p>그래픽</p>
      <p>포토샵 고수, 그림 잘 그림, 웹디자인 가능, 색감 좋음</p>
      <p>프론트엔드 웹개발자 - (주)PUREBLACK(퓨어블랙)</p>
      <p>2021.04 ~ 재직중</p>
      <p>코드그린 프론트엔드 웹개발자 - (주)리더스오브그린소사이어티</p>
      <p>2020.11 ~ 2021.02</p>
      <p>더조은 IT아카데미 - Java 기반 하이브리드 앱개발 과정 이수</p>
      <p>2019.06 ~ 2019.11</p>
      <p>연세대학교 미래교육원 SMEC - 게임그래픽 학과 졸업</p>
      <p>2013.03 ~ 2017.02</p>
    </section>
  )
}

export default About
